MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J60/mcu.h
// Register: MAIPGH
#define MAIPGH MAIPGH
extern volatile unsigned char           MAIPGH              __at(0xEA7);
#ifndef _LIB_BUILD
asm("MAIPGH equ 0EA7h");
#endif

// Register: MAMXFL
#define MAMXFL MAMXFL
extern volatile unsigned short          MAMXFL              __at(0xEAA);
#ifndef _LIB_BUILD
asm("MAMXFL equ 0EAAh");
#endif

// Register: MAMXFLL
#define MAMXFLL MAMXFLL
extern volatile unsigned char           MAMXFLL             __at(0xEAA);
#ifndef _LIB_BUILD
asm("MAMXFLL equ 0EAAh");
#endif

// Register: MAMXFLH
#define MAMXFLH MAMXFLH
extern volatile unsigned char           MAMXFLH             __at(0xEAB);
#ifndef _LIB_BUILD
asm("MAMXFLH equ 0EABh");
#endif

// Register: MICMD
#define MICMD MICMD
extern volatile unsigned char           MICMD               __at(0xEB2);
#ifndef _LIB_BUILD
asm("MICMD equ 0EB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MIIRD                  :1;
        unsigned MIISCAN                :1;
    };
} MICMDbits_t;
extern volatile MICMDbits_t MICMDbits __at(0xEB2);
// bitfield macros
#define _MICMD_MIIRD_POSN                                   0x0
#define _MICMD_MIIRD_POSITION                               0x0
#define _MICMD_MIIRD_SIZE                                   0x1
#define _MICMD_MIIRD_LENGTH                                 0x1
#define _MICMD_MIIRD_MASK                                   0x1
#define _MICMD_MIISCAN_POSN                                 0x1
#define _MICMD_MIISCAN_POSITION                             0x1
#define _MICMD_MIISCAN_SIZE                                 0x1
#define _MICMD_MIISCAN_LENGTH                               0x1
#define _MICMD_MIISCAN_MASK                                 0x2

// Register: MIREGADR
#define MIREGADR MIREGADR
extern volatile unsigned char           MIREGADR            __at(0xEB4);
#ifndef _LIB_BUILD
asm("MIREGADR equ 0EB4h");
#endif

// Register: MIWR
#define MIWR MIWR
extern volatile unsigned short          MIWR                __at(0xEB6);
#ifndef _LIB_BUILD
asm("MIWR equ 0EB6h");
#endif

// Register: MIWRL
#define MIWRL MIWRL
extern volatile unsigned char           MIWRL               __at(0xEB6);
#ifndef _LIB_BUILD
asm("MIWRL equ 0EB6h");
#endif

// Register: MIWRH
#define MIWRH MIWRH
extern volatile unsigned char           MIWRH               __at(0xEB7);
#ifndef _LIB_BUILD
asm("MIWRH equ 0EB7h");
#endif

// Register: MIRD
#define MIRD MIRD
extern volatile unsigned short          MIRD                __at(0xEB8);
#ifndef _LIB_BUILD
asm("MIRD equ 0EB8h");
#endif

// Register: MIRDL
#define MIRDL MIRDL
extern volatile unsigned char           MIRDL               __at(0xEB8);
#ifndef _LIB_BUILD
asm("MIRDL equ 0EB8h");
#endif

// Register: MIRDH
#define MIRDH MIRDH
extern volatile unsigned char           MIRDH               __at(0xEB9);
#ifndef _LIB_BUILD
asm("MIRDH equ 0EB9h");
#endif

// Register: EHT0
#define EHT0 EHT0
extern volatile unsigned char           EHT0                __at(0xEC0);
#ifndef _LIB_BUILD
asm("EHT0 equ 0EC0h");
#endif

// Register: EHT1
#define EHT1 EHT1
extern volatile unsigned char           EHT1                __at(0xEC1);
#ifndef _LIB_BUILD
asm("EHT1 equ 0EC1h");
#endif

// Register: EHT2
#define EHT2 EHT2
extern volatile unsigned char           EHT2                __at(0xEC2);
#ifndef _LIB_BUILD
asm("EHT2 equ 0EC2h");
#endif

// Register: EHT3
#define EHT3 EHT3
extern volatile unsigned char           EHT3                __at(0xEC3);
#ifndef _LIB_BUILD
asm("EHT3 equ 0EC3h");
#endif

// Register: EHT4
#define EHT4 EHT4
extern volatile unsigned char           EHT4                __at(0xEC4);
#ifndef _LIB_BUILD
asm("EHT4 equ 0EC4h");
#endif

// Register: EHT5
#define EHT5 EHT5
extern volatile unsigned char           EHT5                __at(0xEC5);
#ifndef _LIB_BUILD
asm("EHT5 equ 0EC5h");
#endif

// Register: EHT6
#define EHT6 EHT6
extern volatile unsigned char           EHT6                __at(0xEC6);
#ifndef _LIB_BUILD
asm("EHT6 equ 0EC6h");
#endif

// Register: EHT7
#define EHT7 EHT7
extern volatile unsigned char           EHT7                __at(0xEC7);
#ifndef _LIB_BUILD
asm("EHT7 equ 0EC7h");
#endif

// Register: EPMM0
#define EPMM0 EPMM0
extern volatile unsigned char           EPMM0               __at(0xEC8);
#ifndef _LIB_BUILD
asm("EPMM0 equ 0EC8h");
#endif

// Register: EPMM1
#define EPMM1 EPMM1
extern volatile unsigned char           EPMM1               __at(0xEC9);
#ifndef _LIB_BUILD
asm("EPMM1 equ 0EC9h");
#endif

// Register: EPMM2
#define EPMM2 EPMM2
extern volatile unsigned char           EPMM2               __at(0xECA);
#ifndef _LIB_BUILD
asm("EPMM2 equ 0ECAh");
#endif

// Register: EPMM3
#define EPMM3 EPMM3
extern volatile unsigned char           EPMM3               __at(0xECB);
#ifndef _LIB_BUILD
asm("EPMM3 equ 0ECBh");
#endif

// Register: EPMM4
#define EPMM4 EPMM4
extern volatile unsigned char           EPMM4               __at(0xECC);
#ifndef _LIB_BUILD
asm("EPMM4 equ 0ECCh");
#endif

// Register: EPMM5
#define EPMM5 EPMM5
extern volatile unsigned char           EPMM5               __at(0xECD);
#ifndef _LIB_BUILD
asm("EPMM5 equ 0ECDh");
#endif

// Register: EPMM6
#define EPMM6 EPMM6
extern volatile unsigned char           EPMM6               __at(0xECE);
#ifndef _LIB_BUILD
asm("EPMM6 equ 0ECEh");
#endif

// Register: EPMM7
#define EPMM7 EPMM7
extern volatile unsigned char           EPMM7               __at(0xECF);
#ifndef _LIB_BUILD
asm("EPMM7 equ 0ECFh");
#endif

// Register: EPMCS
#define EPMCS EPMCS
extern volatile unsigned short          EPMCS               __at(0xED0);
#ifndef _LIB_BUILD
asm("EPMCS equ 0ED0h");
#endif

// Register: EPMCSL
#define EPMCSL EPMCSL
extern volatile unsigned char           EPMCSL              __at(0xED0);
#ifndef _LIB_BUILD
asm("EPMCSL equ 0ED0h");
#endif

// Register: EPMCSH
#define EPMCSH EPMCSH
extern volatile unsigned char           EPMCSH              __at(0xED1);
#ifndef _LIB_BUILD
asm("EPMCSH equ 0ED1h");
#endif

// Register: EPMO
#define EPMO EPMO
extern volatile unsigned short          EPMO                __at(0xED4);
#ifndef _LIB_BUILD
asm("EPMO equ 0ED4h");
#endif

// Register: EPMOL
#define EPMOL EPMOL
extern volatile unsigned char           EPMOL               __at(0xED4);
#ifndef _LIB_BUILD
asm("EPMOL equ 0ED4h");
#endif

// Register: EPMOH
#define EPMOH EPMOH
extern volatile unsigned char           EPMOH               __at(0xED5);
#ifndef _LIB_BUILD
asm("EPMOH equ 0ED5h");
#endif

// Register: ERXFCON
#define ERXFCON ERXFCON
extern volatile unsigned char           ERXFCON             __at(0xED8);
#ifndef _LIB_BUILD
asm("ERXFCON equ 0ED8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BCEN                   :1;
        unsigned MCEN                   :1;
        unsigned HTEN                   :1;
        unsigned MPEN                   :1;
        unsigned PMEN                   :1;
        unsigned CRCEN                  :1;
        unsigned ANDOR                  :1;
        unsigned UCEN                   :1;
    };
} ERXFCONbits_t;
extern volatile ERXFCONbits_t ERXFCONbits __at(0xED8);
// bitfield macros
#define _ERXFCON_BCEN_POSN                                  0x0
#define _ERXFCON_BCEN_POSITION                              0x0
#define _ERXFCON_BCEN_SIZE                                  0x1
#define _ERXFCON_BCEN_LENGTH                                0x1
#define _ERXFCON_BCEN_MASK                                  0x1
#define _ERXFCON_MCEN_POSN                                  0x1
#define _ERXFCON_MCEN_POSITION                              0x1
#define _ERXFCON_MCEN_SIZE                                  0x1
#define _ERXFCON_MCEN_LENGTH                                0x1
#define _ERXFCON_MCEN_MASK                                  0x2
#define _ERXFCON_HTEN_POSN                                  0x2
#define _ERXFCON_HTEN_POSITION                              0x2
#define _ERXFCON_HTEN_SIZE                                  0x1
#define _ERXFCON_HTEN_LENGTH                                0x1
#define _ERXFCON_HTEN_MASK                                  0x4
#define _ERXFCON_MPEN_POSN                                  0x3
#define _ERXFCON_MPEN_POSITION                              0x3
#define _ERXFCON_MPEN_SIZE                                  0x1
#define _ERXFCON_MPEN_LENGTH                                0x1
#define _ERXFCON_MPEN_MASK                                  0x8
#define _ERXFCON_PMEN_POSN                                  0x4
#define _ERXFCON_PMEN_POSITION                              0x4
#define _ERXFCON_PMEN_SIZE                                  0x1
#define _ERXFCON_PMEN_LENGTH                                0x1
#define _ERXFCON_PMEN_MASK                                  0x10
#define _ERXFCON_CRCEN_POSN                                 0x5
#define _ERXFCON_CRCEN_POSITION                             0x5
#define _ERXFCON_CRCEN_SIZE                                 0x1
#define _ERXFCON_CRCEN_LENGTH                               0x1
#define _ERXFCON_CRCEN_MASK                                 0x20
#define _ERXFCON_ANDOR_POSN                                 0x6
#define _ERXFCON_ANDOR_POSITION                             0x6
#define _ERXFCON_ANDOR_SIZE                                 0x1
#define _ERXFCON_ANDOR_LENGTH                               0x1
#define _ERXFCON_ANDOR_MASK                                 0x40
#define _ERXFCON_UCEN_POSN                                  0x7
#define _ERXFCON_UCEN_POSITION                              0x7
#define _ERXFCON_UCEN_SIZE                                  0x1
#define _ERXFCON_UCEN_LENGTH                                0x1
#define _ERXFCON_UCEN_MASK                                  0x80

// Register: EPKTCNT
#define EPKTCNT EPKTCNT
extern volatile unsigned char           EPKTCNT             __at(0xED9);
#ifndef _LIB_BUILD
asm("EPKTCNT equ 0ED9h");
#endif

// Register: EWRPT
#define EWRPT EWRPT
extern volatile unsigned short          EWRPT               __at(0xEE2);
#ifndef _LIB_BUILD
asm("EWRPT equ 0EE2h");
#endif

// Register: EWRPTL
#define EWRPTL EWRPTL
extern volatile unsigned char           EWRPTL              __at(0xEE2);
#ifndef _LIB_BUILD
asm("EWRPTL equ 0EE2h");
#endif

// Register: EWRPTH
#define EWRPTH EWRPTH
extern volatile unsigned char           EWRPTH              __at(0xEE3);
#ifndef _LIB_BUILD
asm("EWRPTH equ 0EE3h");
#endif

// Register: ETXST
#define ETXST ETXST
extern volatile unsigned short          ETXST               __at(0xEE4);
#ifndef _LIB_BUILD
asm("ETXST equ 0EE4h");
#endif

// Register: ETXSTL
#define ETXSTL ETXSTL
extern volatile unsigned char           ETXSTL              __at(0xEE4);
#ifndef _LIB_BUILD
asm("ETXSTL equ 0EE4h");
#endif

// Register: ETXSTH
#define ETXSTH ETXSTH
extern volatile unsigned char           ETXSTH              __at(0xEE5);
#ifndef _LIB_BUILD
asm("ETXSTH equ 0EE5h");
#endif

// Register: ETXND
#define ETXND ETXND
extern volatile unsigned short          ETXND               __at(0xEE6);
#ifndef _LIB_BUILD
asm("ETXND equ 0EE6h");
#endif

// Register: ETXNDL
#define ETXNDL ETXNDL
extern volatile unsigned char           ETXNDL              __at(0xEE6);
#ifndef _LIB_BUILD
asm("ETXNDL equ 0EE6h");
#endif

